---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.MEPHiddenLineSettings.InsideGap
source: html/da56920b-4e46-c401-2945-ce3d4e5d0c5c.htm
---
# Autodesk.Revit.DB.Mechanical.MEPHiddenLineSettings.InsideGap Property

The gap for the lines that appear within a crossing segment.

## Syntax (C#)
```csharp
public double InsideGap { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - When setting this property: The gap size must be between 0" and 3/4".